server/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-07-20 23:00:36.547833"], ["updated_at", "2017-07-20 23:00:36.547833"]]
---
      def create

        if User.find_by(userID: user_params[:userID])
          @user = User.find_by(userID: user_params[:userID])
        else
          @user = User.create(name: user_params[:name], email: user_params[:email], userID: user_params[:userID], accessToken: user_params[:accessToken])